package com.example.hw4

import android.graphics.drawable.Drawable


object PersonHolder {
    private val personName = arrayOf(
        "Кит Флинт",
        "Ёко Таро",
        "Евклид",
        "Линус Торвальдс",
        "Мик Гордон",
        "Кэнтаро Миура",
        "Лев Толстой",
        "Сергей Есенин",
        "Сидни Шур",
        "Вячеслав Самсонов",
    )

    private val personPhoto = arrayOf(

        R.drawable.pic01,
        R.drawable.pic02,
        R.drawable.pic03,
        R.drawable.pic04,
        R.drawable.pic05,
        R.drawable.pic06,
        R.drawable.pic07,
        R.drawable.pic08,
        R.drawable.pic09,
        R.drawable.pic10,
    )

    private val personDates = arrayOf(
        "1990 - 2019",
        "1970 - ...",
        "325 г. до н.э. - 265 г. до н.э.",
        "1969 - ...",
        "1985 - ...",
        "1966 - 2021",
        "1828 - 1910",
        "1895 - 1925",
        "1893 - 1995",
        "2001 - ...",
    )

    private val personInfo = arrayOf(
        "Кит Чарльз Флинт — бывший вокалист и танцор британской электронной группы «The Prodigy»",

        "Таро Ёко — японский геймдизайнер и сценарист компьютерных игр",

        "Евкли́д или Эвкли́д — древнегреческий математик, автор первого из дошедших до нас теоретических трактатов по математике",

        "Ли́нус Бенедикт То́рвальдс или Ту́рвальдс — финно-американский программист. Создатель ядра Linux",

        "Мик Го́рдон — австралийский композитор и саунд-дизайнер, пишущий музыку преимущественно для компьютерных игр",

        "Кэнтаро Миура — японский мангака, самым известным произведением которого является популярная сэйнэн-манга «Берсерк»",

        "Граф Лев Никола́евич Толсто́й — один из наиболее известных русских писателей и мыслителей, один из величайших писателей-романистов мира",

        "Серге́й Алекса́ндрович Есе́нин — русский поэт, представитель новокрестьянской поэзии и лирики, а в более позднем периоде творчества — имажинизма",

        "Сидни Н. Шур - производитель микрофонов, основатель компании Shure Incorporated",

        "Вячеслав Самсонов - провайдер кода",

        )

    private val personDesc = arrayOf(
        "Кит Чарльз Флинт — бывший вокалист и танцор британской электронной группы «The Prodigy». \n" +
                "Кит Чарльз Флинт родился в Редбридже 17 сентября 1969 года. Семья Кита была не " +
                "совсем благополучной; повзрослев, он перестал общаться с родителями. Родители " +
                "часто переезжали, и Киту приходилось учиться в разных школах. Из-за дислексии " +
                "мальчик учился в основном на тройки. В середине 1970-х годов вместе с родителями " +
                "переехал в Спрингфилд в графство Эссекс. В молодости отец выгнал его из дома, " +
                "и Кит отправился путешествовать. Подрабатывал торговцем на уличных рядах в Израиле, " +
                "работал кровельщиком в Великобритании. С 1988 года стал постоянным участником " +
                "танцевальных вечеринок на автостраде M25.",

        "Таро Ёко — японский геймдизайнер и сценарист компьютерных игр. Начав свою карьеру в ныне " +
                "несуществующей игровой компании Cavia, он стал известен благодаря своей работе " +
                "над серией Action/RPG Drakengard и двумя её ответвлениями: NieR и его " +
                "продолжением, NieR: Automata.\n" +
                "Для игр Ёко характерны нестандартные геймдизайнерские и сценарные решения; " +
                "их повествования часто включают в себя исследование тёмных аспектов души " +
                "человека, темы безумия и убийства. Сам Ёко описывал свой подход к написанию " +
                "сценариев как работу «от конца к началу», где в первую очередь создаётся финал " +
                "игры, а потом — важные сюжетные моменты, «эмоциональные пики», призванные " +
                "привязать игрока к персонажам. Из-за того, что он не любит фотографироваться, " +
                "он обычно носит маску, когда даёт интервью или представляет игры.",

        "Евкли́д или Эвкли́д — древнегреческий математик, автор первого из дошедших до нас " +
                "теоретических трактатов по математике. Биографические сведения о Евклиде " +
                "крайне скудны. Достоверным можно считать лишь то, что его научная деятельность " +
                "протекала в Александрии в III веке до н. э.\n" +
                "Евклид — первый математик Александрийской школы. Его главная работа «Начала» " +
                "(Στοιχεῖα, в латинизированной форме — «Элементы») содержит изложение планиметрии, " +
                "стереометрии и ряда вопросов теории чисел; в ней он подвёл итог предшествующему " +
                "развитию древнегреческой математики и создал фундамент дальнейшего развития " +
                "математики. Из других его сочинений по математике надо отметить «О делении фигур», " +
                "сохранившееся в арабском переводе, 4 книги «Конические сечения», материал которых " +
                "вошёл в произведение того же названия Аполлония Пергского, а также «Поризмы», " +
                "представление о которых можно получить из «Математического собрания» Паппа " +
                "Александрийского. Евклид — автор работ по астрономии, оптике, музыке и др.",

        "Ли́нус Бенедикт То́рвальдс или Ту́рвальдс — финно-американский программист. Создатель ядра Linux.\n" +
                "Воодушевлённый прочтением книги Эндрю Таненбаума, посвящённой операционной системе " +
                "Minix, Линус создал Linux — ядро операционной системы GNU/Linux, являющейся на " +
                "данный момент самой распространённой из свободных операционных систем, а также " +
                "наиболее популярной серверной ОС.\n" +
                "С 1997 по 2003 год Линус работал в известной компании Transmeta. После этого " +
                "организовал Open Source Development Labs. В данный момент работает в The Linux " +
                "Foundation (с 2007), где занимается разработкой ядра Linux.",

        "Мик Го́рдон — австралийский композитор и саунд-дизайнер, пишущий музыку преимущественно " +
                "для компьютерных игр.\n" +
                "Майкл Джон Гордон родился 9 июля 1985 года в городе Маккай (Квинсленд, Австралия). " +
                "Начал работу на Pandemic Studios, затем работал на MachineGames, id Software, " +
                "Arkane Studios, Slightly Mad Studios. В 2010 году номинировался на «Золотую " +
                "катушку» от организации Motion Picture Sound Editors в номинации «Лучший звуковой " +
                "монтаж в компьютерных играх» за работу над игрой Need for Speed: Shift, но не " +
                "выиграл награды.\n" +
                "В 2016 году Гордон создал музыку к научно-фантастическому шутеру от первого " +
                "лица Doom, являющемуся продолжением игры 1993 года от id Software. За музыку " +
                "к этой игре он получил ряд наград, в том числе награду церемонии награждения " +
                "D.I.C.E. Awards в категории «Выдающееся достижение в сочинении музыки», " +
                "награду фестиваля SXSW Gaming Awards в категории «Превосходство в музыке», " +
                "награду церемонии награждения The Game Awards, а также номинировался на Премию " +
                "Британской Академии в области видеоигр в категории «Лучшая музыка».",

        "Кэнтаро Миура — японский мангака, самым известным произведением которого является " +
                "популярная сэйнэн-манга «Берсерк».\n" +
                "Кэнтаро Миура родился в японском городе Тиба 11 июля 1966 года. В 1976 году, когда он " +
                "ещё учился в начальной школе и ему было только десять лет, Миура уже работал " +
                "над мангой. Его первая работа Miuranger была опубликована для одноклассников " +
                "в школьном издании. Со временем Miuranger был завершен в 40 томах. Год спустя " +
                "Миура начал работать над мангой «Путь Меча». Это его первая работа, в " +
                "которой он использовал индийские чернила. К 1979 году Миура, уже ученик " +
                "средней школы, начал использовать в работе растры и профессиональные методы " +
                "рисования. В 1982 году он поступил на художественные курсы в средней школе, " +
                "где вместе со своими одноклассниками публиковал свои работы в школьных изданиях, " +
                "тогда же в журнале для фанов был выпущен его первый додзинси.",

        "Граф Лев Никола́евич Толсто́й — один из наиболее известных русских писателей и мыслителей, " +
                "один из величайших писателей-романистов мира. Участник обороны СевастополяПерейти " +
                "к разделу «#Военная служба». Просветитель, публицист, религиозный мыслитель, " +
                "его авторитетное мнение послужило причиной возникновения нового " +
                "религиозно-нравственного течения — толстовства. За свои взгляды был отлучён " +
                "от церкви. Член-корреспондент Императорской Академии наук (1873), почётный " +
                "академик по разряду изящной словесности (1900). Был номинирован на Нобелевскую " +
                "премию по литературе (1902, 1903, 1904, 1905). Впоследствии отказался от " +
                "дальнейших номинаций. Классик мировой литературы.",

        "Серге́й Алекса́ндрович Есе́нин — русский поэт, представитель новокрестьянской поэзии и " +
                "лирики, а в более позднем периоде творчества — имажинизма. В разные периоды " +
                "творчества в его стихотворениях находили отражение социал-демократические идеи, " +
                "образы революции и Родины, деревни и природы, любви и поиска счастья.",

        "Сидни Н. Шур - производитель микрофонов, основатель компании Shure Incorporated\n" +
                "Shure была основана Сидни Н. Шуром в 1925 году как «The Shure Radio Company». " +
                "Первые несколько лет она выпускала и продавала комплекты радиодеталей. Офис " +
                "компании был расположен в доме 19 по Южной Уэллс-стрит в центре Чикаго. В " +
                "следующем году Shure опубликовал свой первый прямой почтовой каталог, который " +
                "был одним из шести каталогов радиодеталей в США в то время. К 1928 году, " +
                "компания выросла до более чем 75 сотрудников\n" +
                "В настоящее время Shure является одним из мастодонтов в индустрии звукового оборудования",

        "Вячеслав Самсонов - провайдер кода",
    )

    private val personSex = arrayOf(
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
        "Мужчина",
    )

    fun createCollectionPersons(): List<Person> {
        val pictures = mutableListOf<Person>()
        for (i in 0..9) {
            val picture = Person(
                personName[i],
                personPhoto[i],
                personDates[i],
                personInfo[i],
                personDesc[i],
                personSex[i]
            )
            pictures.add(picture)
        }
        return pictures
    }
}

data class Person(
    val Name: String,
    val Image: Int,
    val Date: String,
    val Information: String,
    val Description: String,
    val Gender: String,
)